; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v2 ?v10)
             (pred_11 ?v12 ?v3)
             (pred_4 ?v2 ?v3)
             (pred_10 ?v1 ?v2 )
	     (pred_6 ?v2)
             (pred_8 ?v5)
             (pred_2 ?v12)
             (pred_12 ?v3)
             (pred_1 ?v2)
             (pred_9 ?v12)
             (pred_3 ?v2)
             (pred_7 ))



(:action op_3
:parameters (?v7 ?v13 ?v6 ?v4)
:precondition (and (pred_8 ?v7) (pred_8 ?v13) (pred_2 ?v6) (pred_12 ?v4)
          (pred_5 ?v7 ?v13) (pred_11 ?v6 ?v4)
                   (pred_4 ?v13 ?v4) (pred_6 ?v7) 
                   (pred_1 ?v13) (pred_9 ?v6))
:effect (and  (pred_3 ?v13) (not (pred_1 ?v13))))


(:action op_5
:parameters (?v7 ?v9)
:precondition (and (pred_8 ?v7) (pred_8 ?v9)
               (pred_6 ?v7) (pred_5 ?v7 ?v9) (pred_3 ?v9))
:effect (and (pred_6 ?v9) (not (pred_6 ?v7))))

(:action op_4
:parameters (?v7 ?v6)
:precondition (and (pred_8 ?v7) (pred_2 ?v6) 
                  (pred_6 ?v7) (pred_10 ?v6 ?v7) (pred_7 ))
:effect (and (pred_9 ?v6)
   (not (pred_10 ?v6 ?v7)) (not (pred_7 ))))


(:action op_1
:parameters (?v7 ?v11 ?v8)
:precondition (and (pred_8 ?v7) (pred_2 ?v11) (pred_2 ?v8)
                  (pred_6 ?v7) (pred_9 ?v8) (pred_10 ?v11 ?v7))
:effect (and (pred_9 ?v11) (pred_10 ?v8 ?v7)
        (not (pred_9 ?v8)) (not (pred_10 ?v11 ?v7))))

(:action op_2
:parameters (?v7 ?v6)
:precondition (and (pred_8 ?v7) (pred_2 ?v6) 
                  (pred_6 ?v7) (pred_9 ?v6))
:effect (and (pred_7 ) (pred_10 ?v6 ?v7) (not (pred_9 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_23 obj_06 obj_24 obj_07 obj_18 obj_28 obj_16 obj_08 obj_15 obj_05 obj_31 obj_19 obj_25 obj_10 obj_09 obj_01 obj_20 obj_12 obj_13 obj_04 obj_02 obj_03 obj_30 obj_29
    obj_14 obj_21 obj_26
    obj_22 obj_17 obj_27
    )

    (:init
       (pred_7)

       (pred_8 obj_11)
       (pred_8 obj_23)
       (pred_8 obj_06)
       (pred_8 obj_24)
       (pred_8 obj_07)
       (pred_8 obj_18)
       (pred_8 obj_28)
       (pred_8 obj_16)
       (pred_8 obj_08)
       (pred_8 obj_15)
       (pred_8 obj_05)
       (pred_8 obj_31)
       (pred_8 obj_19)
       (pred_8 obj_25)
       (pred_8 obj_10)
       (pred_8 obj_09)
       (pred_8 obj_01)
       (pred_8 obj_20)
       (pred_8 obj_12)
       (pred_8 obj_13)
       (pred_8 obj_04)
       (pred_8 obj_02)
       (pred_8 obj_03)
       (pred_8 obj_30)
       (pred_8 obj_29)
       (pred_12 obj_14)
       (pred_12 obj_21)
       (pred_12 obj_26)
       (pred_2 obj_22)
       (pred_2 obj_17)
       (pred_2 obj_27)

       (pred_5 obj_11 obj_18)
       (pred_5 obj_11 obj_23)
       (pred_5 obj_23 obj_28)
       (pred_5 obj_23 obj_06)
       (pred_5 obj_23 obj_11)
       (pred_5 obj_06 obj_16)
       (pred_5 obj_06 obj_24)
       (pred_5 obj_06 obj_23)
       (pred_5 obj_24 obj_08)
       (pred_5 obj_24 obj_07)
       (pred_5 obj_24 obj_06)
       (pred_5 obj_07 obj_15)
       (pred_5 obj_07 obj_24)
       (pred_5 obj_18 obj_05)
       (pred_5 obj_18 obj_28)
       (pred_5 obj_18 obj_11)
       (pred_5 obj_28 obj_31)
       (pred_5 obj_28 obj_16)
       (pred_5 obj_28 obj_23)
       (pred_5 obj_28 obj_18)
       (pred_5 obj_16 obj_19)
       (pred_5 obj_16 obj_08)
       (pred_5 obj_16 obj_06)
       (pred_5 obj_16 obj_28)
       (pred_5 obj_08 obj_25)
       (pred_5 obj_08 obj_15)
       (pred_5 obj_08 obj_24)
       (pred_5 obj_08 obj_16)
       (pred_5 obj_15 obj_10)
       (pred_5 obj_15 obj_07)
       (pred_5 obj_15 obj_08)
       (pred_5 obj_05 obj_09)
       (pred_5 obj_05 obj_31)
       (pred_5 obj_05 obj_18)
       (pred_5 obj_31 obj_01)
       (pred_5 obj_31 obj_19)
       (pred_5 obj_31 obj_28)
       (pred_5 obj_31 obj_05)
       (pred_5 obj_19 obj_20)
       (pred_5 obj_19 obj_25)
       (pred_5 obj_19 obj_16)
       (pred_5 obj_19 obj_31)
       (pred_5 obj_25 obj_12)
       (pred_5 obj_25 obj_10)
       (pred_5 obj_25 obj_08)
       (pred_5 obj_25 obj_19)
       (pred_5 obj_10 obj_13)
       (pred_5 obj_10 obj_15)
       (pred_5 obj_10 obj_25)
       (pred_5 obj_09 obj_04)
       (pred_5 obj_09 obj_01)
       (pred_5 obj_09 obj_05)
       (pred_5 obj_01 obj_02)
       (pred_5 obj_01 obj_20)
       (pred_5 obj_01 obj_31)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_20 obj_03)
       (pred_5 obj_20 obj_12)
       (pred_5 obj_20 obj_19)
       (pred_5 obj_20 obj_01)
       (pred_5 obj_12 obj_30)
       (pred_5 obj_12 obj_13)
       (pred_5 obj_12 obj_25)
       (pred_5 obj_12 obj_20)
       (pred_5 obj_13 obj_29)
       (pred_5 obj_13 obj_10)
       (pred_5 obj_13 obj_12)
       (pred_5 obj_04 obj_02)
       (pred_5 obj_04 obj_09)
       (pred_5 obj_02 obj_03)
       (pred_5 obj_02 obj_01)
       (pred_5 obj_02 obj_04)
       (pred_5 obj_03 obj_30)
       (pred_5 obj_03 obj_20)
       (pred_5 obj_03 obj_02)
       (pred_5 obj_30 obj_29)
       (pred_5 obj_30 obj_12)
       (pred_5 obj_30 obj_03)
       (pred_5 obj_29 obj_13)
       (pred_5 obj_29 obj_30)
       (pred_1 obj_15)
       (pred_1 obj_07)
       (pred_1 obj_18)
       (pred_4  obj_15 obj_14)
       (pred_4  obj_07 obj_21)
       (pred_4  obj_18 obj_26)
       (pred_3 obj_11)
       (pred_3 obj_23)
       (pred_3 obj_06)
       (pred_3 obj_24)
       (pred_3 obj_28)
       (pred_3 obj_16)
       (pred_3 obj_08)
       (pred_3 obj_05)
       (pred_3 obj_31)
       (pred_3 obj_19)
       (pred_3 obj_25)
       (pred_3 obj_10)
       (pred_3 obj_09)
       (pred_3 obj_01)
       (pred_3 obj_20)
       (pred_3 obj_12)
       (pred_3 obj_13)
       (pred_3 obj_04)
       (pred_3 obj_02)
       (pred_3 obj_03)
       (pred_3 obj_30)
       (pred_3 obj_29)

       (pred_11  obj_22 obj_14)
       (pred_11  obj_17 obj_21)
       (pred_11  obj_27 obj_26)
       (pred_10 obj_22 obj_12)
       (pred_10 obj_17 obj_29)
       (pred_10 obj_27 obj_28)
       (pred_6 obj_03)
    )

    (:goal (and
       (pred_10 obj_22 obj_31)
       (pred_10 obj_27 obj_16)
    ))
(:constraints
  (always (not (pred_6 obj_25)))
)
)

; plan
1. (op_5 obj_03 obj_20)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_20)
   goals met: 0 of 2
2. (op_5 obj_20 obj_19)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_19)
   goals met: 0 of 2
3. (op_5 obj_19 obj_31)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_31)
   goals met: 0 of 2
4. (op_5 obj_31 obj_28)
   deleted: (pred_6 obj_31)
   added: (pred_6 obj_28)
   goals met: 0 of 2
5. (op_4 obj_28 obj_27)
   deleted: (pred_10 obj_27 obj_28) (pred_7)
   added: (pred_9 obj_27)
   goals met: 0 of 2
6. (op_5 obj_28 obj_16)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_16)
   goals met: 0 of 2
7. (op_2 obj_16 obj_27)
   deleted: (pred_9 obj_27)
   added: (pred_7) (pred_10 obj_27 obj_16)
   goals met: 1 of 2
8. (op_5 obj_16 obj_19)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_19)
   goals met: 1 of 2
9. (op_5 obj_19 obj_20)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_20)
   goals met: 1 of 2
10. (op_5 obj_20 obj_12)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_12)
   goals met: 1 of 2
11. (op_4 obj_12 obj_22)
   deleted: (pred_10 obj_22 obj_12) (pred_7)
   added: (pred_9 obj_22)
   goals met: 1 of 2
12. (op_5 obj_12 obj_20)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_20)
   goals met: 1 of 2
13. (op_5 obj_20 obj_19)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_19)
   goals met: 1 of 2
14. (op_5 obj_19 obj_31)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_31)
   goals met: 1 of 2
15. (op_2 obj_31 obj_22)
   deleted: (pred_9 obj_22)
   added: (pred_7) (pred_10 obj_22 obj_31)
   goals met: 2 of 2
